# Brewfile — complete package list

# CLI essentials
brew "git"
brew "wget"
brew "tldr"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"
brew "gh"
brew "tree"
brew "htop"
brew "zsh"
brew "go-task"
brew "spectral-cli"

# Dev runtimes — mise manages node/python (see mise/config.toml)
brew "mise"

# Secrets management
cask "1password-cli"

# AI / Agent
cask "claude"
cask "claude-code"
cask "cmux"

# Mac apps
cask "ghostty"
cask "visual-studio-code"
cask "zed"
cask "google-chrome"
cask "docker-desktop"
cask "raycast"
cask "stats"
cask "alt-tab"
cask "hiddenbar"
cask "itsycal"
cask "time-out"
cask "linear-linear"
cask "slack"
cask "discord"
cask "spotify"
cask "1password"

# Fonts
cask "font-jetbrains-mono-nerd-font"
