# Brewfile — complete package list

# CLI essentials
brew "git"
brew "wget"
brew "tldr"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"
brew "gh"
brew "tree"
brew "htop"
brew "zsh"

# Dev runtimes
brew "node"
brew "python"
brew "pyenv"
brew "nvm"

# AI / Agent
brew "claude-code"
brew "cmux"

# Mac apps
cask "ghostty"
cask "visual-studio-code"
cask "google-chrome"
cask "docker-desktop"
cask "raycast"
cask "stats"
cask "alt-tab"
cask "hiddenbar"
cask "itsycal"
cask "time-out"
cask "linear-linear"
cask "slack"
cask "discord"
cask "1password"

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"
