zhuangtongfa.material-theme
pkief.material-icon-theme
usernamehw.errorlens
eamodio.gitlens
esbenp.prettier-vscode
dbaeumer.vscode-eslint
ms-python.python
ms-python.pylance
ms-python.black-formatter
ms-azuretools.vscode-docker
ms-vscode-remote.remote-ssh
redhat.vscode-yaml
gruntfuggly.todo-tree
humao.rest-client
rangav.vscode-thunder-client
yzhang.markdown-all-in-one
streetsidesoftware.code-spell-checker
anthropics.claude-code

# Contracts & API design
42crunch.vscode-openapi
asyncapi.asyncapi-preview

